In [1]:
import pandas as pd
file_name = 'student.csv'

df = pd.read_csv(file_name)
df

   id  fname  age              email      phone
0   1   Amit   20     amit@gmail.com  999999999
1   2  Rahul   22    rahul@yahoo.com  888888888
2   3  Priya   21  priya@hotmail.com  777777777
3   4  Sonia   23    sonia@gmail.com  666666666
4   5  Kiran   19    kiran@yahoo.com  555555555

In [2]:
table = file_name.split('.')[0]
table

'student'

In [3]:
x = ''

for i in df.columns:
  x += i + ' VARCHAR(100),\n'

x += '\b\b'
print(x)

id VARCHAR(100),
fname VARCHAR(100),
age VARCHAR(100),
email VARCHAR(100),
phone VARCHAR(100),


In [4]:
y = ''
for row in df.iterrows():
  y += '('
  for j in row[1]:
    y += f"'{j}', "
  y += '\b\b),\n'

y += '\b'
print(y)

('1', 'Amit', '20', 'amit@gmail.com', '999999999', ),
('2', 'Rahul', '22', 'rahul@yahoo.com', '888888888', ),
('3', 'Priya', '21', 'priya@hotmail.com', '777777777', ),
('4', 'Sonia', '23', 'sonia@gmail.com', '666666666', ),
('5', 'Kiran', '19', 'kiran@yahoo.com', '555555555', ),


In [5]:
z = ''
for i in df.columns:
  z += f"{i}, "

z += '\b\b'
print(z)

id, fname, age, email, phone, 

In [6]:
vicks = f'''%%sql
-- DROP TABLE {table};

CREATE TABLE {table} (
{x}
);

INSERT INTO {table} ({z})
VALUES
{y}\b;

SELECT * FROM {table};'''
print(vicks)

%%sql
-- DROP TABLE student;

CREATE TABLE student (
id VARCHAR(100),
fname VARCHAR(100),
age VARCHAR(100),
email VARCHAR(100),
phone VARCHAR(100),

);

INSERT INTO student (id, fname, age, email, phone, )
VALUES
('1', 'Amit', '20', 'amit@gmail.com', '999999999', ),
('2', 'Rahul', '22', 'rahul@yahoo.com', '888888888', ),
('3', 'Priya', '21', 'priya@hotmail.com', '777777777', ),
('4', 'Sonia', '23', 'sonia@gmail.com', '666666666', ),
('5', 'Kiran', '19', 'kiran@yahoo.com', '555555555', ),
;

SELECT * FROM student;

In [7]:
!pip install "SQLAlchemy<1.4"

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: SQLAlchemy<1.4 in /usr/local/lib/python3.10/dist-packages (1.3.24)

In [8]:
%load_ext sql

In [9]:
%%sql sqlite:///testDB.db

In [10]:
def transform(file_name = 'student.csv'):
  import pandas as pd

  df = pd.read_csv(file_name)
  table = file_name.split('.')[0]
  x = ''

  for i in df.columns:
    x += i + ' VARCHAR(100),\n'

  x += '\b\b'
  y = ''
  for row in df.iterrows():
    y += '('
    for j in row[1]:
      y += f"'{j}', "
    y += '\b\b),\n'

  y += '\b'
  z = ''
  for i in df.columns:
    z += f"{i}, "

  z += '\b\b'
  return f'''%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE {table};

CREATE TABLE {table} (
{x}
);

INSERT INTO {table} ({z})
VALUES
{y}\b;

SELECT * FROM {table};'''

In [11]:
print(transform('student.csv'))

%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE student;

CREATE TABLE student (
id VARCHAR(100),
fname VARCHAR(100),
age VARCHAR(100),
email VARCHAR(100),
phone VARCHAR(100),

);

INSERT INTO student (id, fname, age, email, phone, )
VALUES
('1', 'Amit', '20', 'amit@gmail.com', '999999999', ),
('2', 'Rahul', '22', 'rahul@yahoo.com', '888888888', ),
('3', 'Priya', '21', 'priya@hotmail.com', '777777777', ),
('4', 'Sonia', '23', 'sonia@gmail.com', '666666666', ),
('5', 'Kiran', '19', 'kiran@yahoo.com', '555555555', ),
;

SELECT * FROM student;

In [12]:
%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE student;

CREATE TABLE student (
id VARCHAR(100),
fname VARCHAR(100),
age VARCHAR(100),
email VARCHAR(100),
phone VARCHAR(100)
);

INSERT INTO student (id, fname, age, email, phone)
VALUES
('1', 'Amit', '20', 'amit@gmail.com', '999999999'),
('2', 'Rahul', '22', 'rahul@yahoo.com', '888888888'),
('3', 'Priya', '21', 'priya@hotmail.com', '777777777'),
('4', 'Sonia', '23', 'sonia@gmail.com', '666666666'),
('5', 'Kiran', '19', 'kiran@yahoo.com', '555555555');

SELECT * FROM student;

 * sqlite:///testDB.db
(sqlite3.OperationalError) table student already exists
[SQL: /*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE student;

CREATE TABLE student (
id VARCHAR(100),
fname VARCHAR(100),
age VARCHAR(100),
email VARCHAR(100),
phone VARCHAR(100)
);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [13]:
print(transform('employee.csv'))

%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE employee;

CREATE TABLE employee (
employee_id VARCHAR(100),
employee_name VARCHAR(100),
salary VARCHAR(100),

);

INSERT INTO employee (employee_id, employee_name, salary, )
VALUES
('1', 'Shubham', '25000', ),
('2', 'Aman', '55100', ),
('3', 'Naveen', '52100', ),
('4', 'Aditya', '12412', ),
('5', 'Nishant', '62202', ),
;

SELECT * FROM employee;

In [14]:
%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE employee;

CREATE TABLE employee (
employee_id VARCHAR(100),
employee_name VARCHAR(100),
salary VARCHAR(100)
);

INSERT INTO employee (employee_id, employee_name, salary)
VALUES
('1', 'Shubham', '25000'),
('2', 'Aman', '55100'),
('3', 'Naveen', '52100'),
('4', 'Aditya', '12412'),
('5', 'Nishant', '62202');

SELECT * FROM employee;

 * sqlite:///testDB.db
(sqlite3.OperationalError) table employee already exists
[SQL: /*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE employee;

CREATE TABLE employee (
employee_id VARCHAR(100),
employee_name VARCHAR(100),
salary VARCHAR(100)
);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [15]:
print(transform('customer.csv'))

%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE customer;

CREATE TABLE customer (
customer_id VARCHAR(100),
customername VARCHAR(100),
lastname VARCHAR(100),
country VARCHAR(100),
age VARCHAR(100),
phone VARCHAR(100),

);

INSERT INTO customer (customer_id, customername, lastname, country, age, phone, )
VALUES
('1', 'Shubham', 'Thakur', 'India', '23', 'xxxxxxxxxx', ),
('2', 'Aman', 'Chopra', 'Australia', '21', 'xxxxxxxxxx', ),
('3', 'Naveen', 'Tulasi', 'Sri Lanka', '24', 'xxxxxxxxxx', ),
('4', 'Aditya', 'Arpan', 'Austria', '21', 'xxxxxxxxxx', ),
('5', 'Nishant. Salchichas S.A.', 'Jain', 'Spain', '22', 'xxxxxxxxxx', ),
;

SELECT * FROM customer;

In [16]:
%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

DROP TABLE customer;

CREATE TABLE customer (
customer_id VARCHAR(100),
customername VARCHAR(100),
lastname VARCHAR(100),
country VARCHAR(100),
age VARCHAR(100),
phone VARCHAR(100)
);

INSERT INTO customer (customer_id, customername, lastname, country, age, phone)
VALUES
('1', 'Shubham', 'Thakur', 'India', '23', 'xxxxxxxxxx'),
('2', 'Aman', 'Chopra', 'Australia', '21', 'xxxxxxxxxx'),
('3', 'Naveen', 'Tulasi', 'Sri Lanka', '24', 'xxxxxxxxxx'),
('4', 'Aditya', 'Arpan', 'Austria', '21', 'xxxxxxxxxx'),
('5', 'Nishant. Salchichas S.A.', 'Jain', 'Spain', '22', 'xxxxxxxxxx');

SELECT * FROM customer;

 * sqlite:///testDB.db
Done.
Done.
5 rows affected.
Done.

[('1', 'Shubham', 'Thakur', 'India', '23', 'xxxxxxxxxx'),
 ('2', 'Aman', 'Chopra', 'Australia', '21', 'xxxxxxxxxx'),
 ('3', 'Naveen', 'Tulasi', 'Sri Lanka', '24', 'xxxxxxxxxx'),
 ('4', 'Aditya', 'Arpan', 'Austria', '21', 'xxxxxxxxxx'),
 ('5', 'Nishant. Salchichas S.A.', 'Jain', 'Spain', '22', 'xxxxxxxxxx')]

In [17]:
!pip install csv2sqltable -U

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: csv2sqltable in /usr/local/lib/python3.10/dist-packages (0.0.4)

In [18]:
import csv2sqltable.convert as c2s
c2s

In [19]:
help(c2s)

Help on module csv2sqltable.convert in csv2sqltable:

NAME
    csv2sqltable.convert

FUNCTIONS
    transform(file_name='student.csv')

FILE
    /usr/local/lib/python3.10/dist-packages/csv2sqltable/convert.py

In [20]:
tbl = c2s.transform('/content/customer.csv')
print(tbl)

%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE /content/customer;

CREATE TABLE /content/customer (
customer_id VARCHAR(100),
customername VARCHAR(100),
lastname VARCHAR(100),
country VARCHAR(100),
age VARCHAR(100),
phone VARCHAR(100),

);

INSERT INTO /content/customer (customer_id, customername, lastname, country, age, phone, )
VALUES
('1', 'Shubham', 'Thakur', 'India', '23', 'xxxxxxxxxx', ),
('2', 'Aman', 'Chopra', 'Australia', '21', 'xxxxxxxxxx', ),
('3', 'Naveen', 'Tulasi', 'Sri Lanka', '24', 'xxxxxxxxxx', ),
('4', 'Aditya', 'Arpan', 'Austria', '21', 'xxxxxxxxxx', ),
('5', 'Nishant. Salchichas S.A.', 'Jain', 'Spain', '22', 'xxxxxxxxxx', ),
;

SELECT * FROM /content/customer;

In [22]:
import csv2sqltable.convert as c2s
print(c2s.transform('employee.csv'))

%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE employee;

CREATE TABLE employee (
employee_id VARCHAR(100),
employee_name VARCHAR(100),
salary VARCHAR(100),

);

INSERT INTO employee (employee_id, employee_name, salary, )
VALUES
('1', 'Shubham', '25000', ),
('2', 'Aman', '55100', ),
('3', 'Naveen', '52100', ),
('4', 'Aditya', '12412', ),
('5', 'Nishant', '62202', ),
;

SELECT * FROM employee;

In [23]:
%%sql
/*
!pip install "SQLAlchemy<1.4"

%reload_ext sql

%%sql sqlite:///vicks.db
*/

-- DROP TABLE employee;

CREATE TABLE employee (
employee_id VARCHAR(100),
employee_name VARCHAR(100),
salary VARCHAR(100)
);

INSERT INTO employee (employee_id, employee_name, salary)
VALUES
('1', 'Shubham', '25000'),
('2', 'Aman', '55100'),
('3', 'Naveen', '52100'),
('4', 'Aditya', '12412'),
('5', 'Nishant', '62202');

SELECT * FROM employee;

 * sqlite:///testDB.db
Done.
Done.
5 rows affected.
Done.

[('1', 'Shubham', '25000'),
 ('2', 'Aman', '55100'),
 ('3', 'Naveen', '52100'),
 ('4', 'Aditya', '12412'),
 ('5', 'Nishant', '62202')]